const people = [
  {
    iin: '111111111111',
    name: 'Жуманов Мирлан',
    birthYear: 2005,
    address: 'Актобе қ., Алты орда көш., 17г',
    clinic: 'ТТИК Поликлиника',
    history: [
      '2021 жылдың қыркүйек айы: Пациент жүрек соғу жиілігінің тұрақсыздығымен шағымданды. Диагноз: "Жүрек соғу жиілігінің ауытқуы". Емдеу барысында кардиолог кеңесі берілді, жүрек соғуын реттеуге арналған "Бисопролол" препараты тағайындалды.',
      '2022 жылдың наурыз айы: "Гипертониялық криз". Пациенттің қан қысымы өте жоғары болған. Емдеу барысында дәрілік терапия және өмір салтын өзгерту ұсынылды. Қан қысымын тұрақтандыру үшін арнайы диета енгізілді.',
      '2023 жылдың қаңтар айы: "Асқазан гастриті". Пациент асқазан ауруларына байланысты гастроэнтерологқа жолданды. Асқазанның қышқылдығын төмендету үшін препараттар берілді, сондай-ақ арнайы диета ұсынылды. Ем нәтижесінде асқазан аурулары азайды.'
    ]
  },
  {
    iin: '222222222222',
    name: 'Шатенов Даулет',
    birthYear: 2003,
    address: 'Актобе қ., Манас көш., 10',
    clinic: '№1 Поликлиника',
    history: [
      '2020 жылдың шілде айы: Пациент жоғары қан қысымына шағымданды. Диагноз: "Гипертония". Емдеу барысында гипотензиялық препараттар тағайындалды. Өмір салтын жақсарту және тұзды азайту ұсынылды.',
      '2021 жылдың желтоқсан айы: "Жүрек ишемиясы". Ауырған кезде жүрек тұсында қатты ауырсыну сезілген. Стационарлық емдеу кезінде қан айналымын жақсартатын препараттар енгізілді. Емдеу нәтижесінде жағдайы тұрақтанды.',
      '2022 жылдың маусым айы: "Тамыр тарылуы". Дәрігер науқастың қан тамырларының жағдайын тексерді. Ем барысында тамырларды кеңейтетін дәрілер тағайындалды. Дұрыс диета және тұрақты жаттығулар ұсынылды.'
    ]
  },
  {
    iin: '333333333333',
    name: 'Байгалиева Меруерт',
    birthYear: 2005,
    address: 'Актобе қ., Алии молдагулова., 34в',
    clinic: '№3 Поликлиника',
    history: [
      '2022 жылдың сәуір айы: Пациентке "Қант диабеті (2 тип)" диагнозы қойылды. Ем барысында қант деңгейін бақылауға арналған диета енгізілді, инсулин терапиясы басталды. Эндокринолог тұрақты бақылауда ұстады.',
      '2022 жылдың қазан айы: Қан тамырларының жағдайын тексеру кезінде кішігірім тарылулар анықталды. Емдеу кезінде қан айналымын жақсартатын дәрі-дәрмектер тағайындалды.',
      '2023 жылдың қаңтар айы: Пациент семіздікпен байланысты эндокринологтың қосымша кеңесін алды. Жеке жаттығу бағдарламасы және дұрыс тамақтану жоспары ұсынылды. Нәтижесінде, науқастың жалпы жағдайы жақсарды.'
    ]
  },
  {
    iin: '444444444444',
    name: 'Жұмамұратова Гүлнұр',
    birthYear: 2004,
    address: 'Актобе қ., Алтын орда., 25',
    clinic: '№4 Поликлиника',
    history: [
      '2021 жылдың мамыр айы: Пациентке "Жүкті әйелдердің анемиясы" диагнозы қойылды. Емдеу барысында темір деңгейін жоғарылататын дәрілер тағайындалды.',
      '2022 жылдың қазан айы: "Созылмалы бронхит". Пациент тыныс алу жүйесінің бұзылыстарына шағымданды. Емдеу барысында ингаляциялық терапия және антибиотиктер тағайындалды.',
      '2023 жылдың ақпан айы: "Жүрекке артық жүктеме". Кардиологтың тұрақты бақылауы және жүрек соғуын тұрақтандыратын дәрілер тағайындалды.'
    ]
  },
  {
    iin: '555555555555',
    name: 'Әлиев Қайрат',
    birthYear: 1982,
    address: 'Тараз қ., Бәйтерек көш., 19',
    clinic: '№2 Поликлиника',
    history: [
      '2020 жылдың қараша айы: Пациентке "Омыртқа остеохондрозы" диагнозы қойылды. Емдеу барысында физиотерапия және арнайы жаттығулар тағайындалды.',
      '2021 жылдың сәуір айы: "Диабет (1 тип)". Қант деңгейін бақылау үшін инсулин терапиясы басталды. Дұрыс тамақтану және жаттығу жоспары ұсынылды.',
      '2022 жылдың шілде айы: "Бауыр майлануы". Диагностика кезінде дұрыс диета және бауырды тазартатын дәрілер тағайындалды.'
    ]
  }
];



function searchPerson(event) {
  event.preventDefault();
  const searchInput = document.getElementById('search-input').value.trim();
  const resultsTable = document.querySelector('#results-table tbody');
  resultsTable.innerHTML = ''; // Очищаем предыдущие результаты

  if (!searchInput) {
    resultsTable.innerHTML = '<tr><td colspan="5" style="text-align:center;">Іздеу үшін ИИН немесе Аты енгізіңіз.</td></tr>';
    return;
  }

  const filteredPeople = people.filter(person =>
    person.iin === searchInput || person.name.toLowerCase().includes(searchInput.toLowerCase())
  );

  if (filteredPeople.length > 0) {
    filteredPeople.forEach(person => {
      const row = document.createElement('tr');
      row.setAttribute('data-iin', person.iin);
      row.innerHTML = `
        <td>${person.iin}</td>
        <td>${person.name}</td>
        <td>${person.birthYear}</td>
        <td>${person.address}</td>
        <td>${person.clinic}</td>
      `;
      row.addEventListener('click', () => viewDetails(person.iin));
      resultsTable.appendChild(row);
    });
  } else {
    resultsTable.innerHTML = '<tr><td colspan="5" style="text-align:center;">Ақпарат табылмады.</td></tr>';
  }
}

function viewDetails(iin) {
  const person = people.find(p => p.iin === iin);
  if (person) {
    localStorage.setItem('selectedPerson', JSON.stringify(person));
    window.location.href = 'details.html';
  }
}
